In [1]:
%load_ext ml_optic

marklogic optic magic loaded.

In [2]:
%%ml_optic?

In [3]:
ROWS=30

In [5]:
%%ml_optic xquery://admin:admin@localhost:8059
xquery version "1.0-ml";

import module namespace op="http://marklogic.com/optic"
     at "/MarkLogic/optic.xqy";
            
op:from-view("zomato", "reviews",'')
   => op:select(("Id", "Name", "Locality", "Country", "RatingColor", "Latitude","Longitude","AverageCostForTwo"))
   => op:order-by("Id")
   => op:limit({ROWS}) 
   => op:result()

Returned 30 results
ml_optic.head() returns:

,Id,Name,Locality,Country,RatingColor,Latitude,Longitude,AverageCostForTwo
0,100305,The Forresta Kitchen & Bar,"Devraj Niwas, Bani Park",India,Green,26.921411,75.793604,1800
1,100306,Replay,Tonk Road,India,Green,26.892312,75.806896,1500
2,101212,Tapri Central,C Scheme,India,Dark Green,26.905190,75.810753,750
3,101259,On The House,C Scheme,India,Green,26.905287,75.794592,1300
4,101311,Taruveda Bistro,Civil Lines,India,Green,26.911378,75.789034,1000

In [9]:
%%ml_optic xquery://admin:admin@localhost:8000
xquery version "1.0-ml";

import module namespace op="http://marklogic.com/optic"
     at "/MarkLogic/optic.xqy";
            
op:from-view("sys", "sys_tables",'')
   => op:result()

Returned 5 results
ml_optic.head() returns:

  schema   type            name        tbl_name  rootpage  sql
0    sys  table     sys_columns     sys_columns         0  NaN
1    sys  table  sys_collations  sys_collations         0  NaN
2    sys  table   sys_functions   sys_functions         0  NaN
3    sys  table     sys_schemas     sys_schemas         0  NaN
4    sys  table      sys_tables      sys_tables         0  NaN